courses/specialist/уровень-4/модуль-5/lab5/server/messages/deleteBook-request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <req:deleteBook xmlns:req="urn:BooksService">
      <bookId xsi:type="xsd:int">0</bookId>
    </req:deleteBook>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
